package by.ld.hw.conditions;

/**
 * Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в
 * противном случае – слово «no»
 */

public class Task2 {
    public static void main(String[] args) {
        if(1 < 2){
            System.out.println("Yes");
        } else {
            System.out.println("No");
        }
    }
}