package by.ld.hw.conditions;

/**
 * Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7, в противном
 * случае – цифру 8.
 */

public class Task1 {
    public static void main(String[] args) {
        if(1 < 2) {
            System.out.println("7");
        } else {
            System.out.println("8");
        }
    }
}
